---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarContainerItem
source: html/3fc67be9-3bca-9ee3-3984-e495547c09f4.htm
---
# RebarContainerItem Methods

Checks if a presentation mode can be applied for this rebar in the given view.